<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Faker\Factory as Faker;
use Illuminate\Support\Facades\Hash;



class TeacherSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //
        $teachers = [
            'م.عبد الحميد الواعر',
            'أ.مراد',
            'م.هدى جمعة',
            'أ.ناصر ضياف',
            'ا.زهره الاشعل',
            'ا.عبد سلام القطاوي',
            'ا.كرم نصار',
            'ا .احمد بن مصطفى',
            'ا.ناجي عبد الرحمن',
            'ا.عبد حكيم قجة',
            'ا.محمد الفرجاني (رحمه الله)',
            'ا.زهرة الأشعل',
            'د.ظافر خليل',
            'د.عبد القادر الأمين',
            'د.محمد شرود',
            'د.حافظ البوعيشي',
            'د.ضياء مزوغي',
            'د.طارق الشويهدي',
            'م.مصطفى الطاهر',
            'د.نوري ميلادي',
            'د.صلاح العيدودي',
            'ربيع شويهدي'
            ,
            'ا.ربيع الشويهدي-Python',
            'زياد شنيب',
            'خالد المزوغي',
            'حسن ناجي',
            'منذر',
            'احمد الناجح',
            'د.مصطفى الشاطر',
            'أ.أيمن الترهوني',
            'أ.حياة الغولة',
            'د. محمد المزوغي',
            'أ. مختار عبد النور',
            'أ.حيدر السويح',
            'د.سعيد عكة',
            'د.امحمد بحيح',
            'أ.عبد الباسط المشاط',
            'أ. حسام الهنشيري',
            'أ. أحمد عاشور',
            'ا.مصطفى دومة',
            'أ.إدريس إنبيص',
            'م.أريج أبوقرين',
            'د.مسعود الداقل',
            'د.تمام بن موسى',
            'د.بشير الجللي',
            'د.عبد الجواد المزوغي',
            'ا.سليمان الهاشمي',
            'أ.اماني',
            'د.صلاح العيدوي' ,
            'جلال الميلادي',
            'أ.رولا',
            'ا.حياة',
            'م.اية',
            'د.سميح',
            'د.نوري الميلادي',
            'ا. عبدالسلام القطاوي',
            'ا. رويدا محمد',
            'د.محمد بوكر',
            'م.أميرة الزيانى',
            'ا.امال نوري',
            'أ. علي حسين',
            'ا.فتحي مختار'
            ,'د.مبروكة'
            ,' د محمد عبد الله'
            ,'م.سعد العز' 
            ,'  أ.ياسين العويلي  '
            ,'د.مسعود الداقل'
            ,'أ.مسعود',
            'مشاركات الطلبة'
            ,'أ.محمد الجعفري'
            ,'أ.محمد الفرجاني (رحمة الله عليه) و ا.محمد الجعفري'
            ,'د.مصباح الاحرش'
            ,'ا.مروان مرغم',
            'م.احمد قريرة DSP',
            'د.علي حسين Python',
            'IOT د.علي حسين',
            'IOT-أ.ربيع الشويهدي',
            'محتوى ينصح به'
       
        ];


        foreach($teachers as $teacherName){
            $faker = Faker::create();

            \App\Models\Teacher::create([
                'name' => $teacherName,
                'ref_number' => str_pad(random_int(0, 9999), 4, '0', STR_PAD_LEFT),
                'email'=> $faker->email(),
                'phone_number'=> $faker->phoneNumber(),
                'password' =>  Hash::make('password')
            ]);
        }
    }
}